// Check for email from Dropbox w/a PDF attachment:
EmailEvents
| where SenderDisplayName contains "Dropbox"
| where AttachmentCount > 0
| join EmailAttachmentInfo on NetworkMessageId
| where FileName matches regex @"[A-Z]{10}.pdf"
| where EmailDirection == 'Inbound
